<?php

// 某产品的⽤户注册邀请码为⼀串有⼩写字⺟和数字组成的字符串，字符串⻓度为16。当⽤户输入邀
// 请码的时候，系统需要对邀请码做有效性验证，假设验证规则如下：
// 1、从序列号最后⼀位字符开始，逆向将奇数位(1、3、5等等)相加；
// 2、从序列号最后⼀位数字开始，逆向将偶数位数字，先乘以2（如果乘积为两位数，则将其减去9），再求和；
// 3、将奇数位总和加上偶数位总和，结果可以被10整除；
// 4、⼩写字⺟对应数值，可由下⾯键值对确定；
// [(a,1), (b,2), (c,3)…,(i,9), (j,1), (k, 2)…]，亦即，按字⺟顺序，1-9循环。
// 输⼊：输⼊16位字符串，表示邀请码
// 输出：输出“ok”或者“error”

class Solution
{
    function checkInviteCode($str)
    {
        $map = [
            'a' => 1, 'b' => 2, 'c' => 3, 'd' => 4, 'e' => 5, 'f' => 6, 'g' => 7, 'h' => 8, 'i' => 9,
            'j' => 1, 'k' => 2, 'l' => 3, 'm' => 4, 'n' => 5, 'o' => 6, 'p' => 7, 'q' => 8, 'r' => 9,
            's' => 1, 't' => 2, 'u' => 3, 'v' => 4, 'w' => 5, 'x' => 6, 'y' => 7, 'z' => 8,
            '1' => 1, '2' => 2, '3' => 3, '4' => 4, '5' => 5, '6' => 6, '7' => 7, '8' => 8, '9' => 9, '0' => 0,
        ];
        $allowStrings = array_keys($map);
        $len = strlen($str);
        if ($len !== 16) {
            return 'error';
        }
        $sum1 = 0; // 奇数位
        $sum2 = 0; // 偶数位
        for ($i = $len - 1; $i >= 0; $i--) {
            $char = $str[$i];
            if (!in_array($char, $allowStrings, false)) {
                return 'error';
            }
            if ($i % 2 === 0) {
                $sum2 += 2 * $map[$char];
                if ($sum2 > 9) {
                    $sum2 -= 9;
                }
            } else {
                $sum1 += $map[$char];
            }
        }
        return ($sum1 + $sum2) % 10 === 0 ? 'ok' : 'error';
    }
}

$s = new Solution();
var_dump($s->checkInviteCode('1234566181214431')); // error
